// lab2.cpp: определяет точку входа для консольного приложения.
//


#include <iostream>




using namespace std;
string name;

int main()
{
	setlocale(LC_ALL, "RUS");

	cout << "Лабораторная работа №2"<< endl <<"Найти количество трехзначных чисел в массиве A[12], " << endl << "кратных 15, но не кратных 30. Вывести их на экран монитора." << endl << endl;
	
	
	{int A[12] = {105}; // наш массив
	
	int sum=0; // подсчет кол-ва циклов (т.е 3х значных цифр)

		for(A[0]>104;A[0]<976;A[0]+=30){   //зациклим вывод чисел *./ каждый раз к числу +30 и так пока не дойдет до 975
			cout << A[0] << " ";
		sum++;} // каждый раз, когда выполняется цикл +1 к sum
		cout << endl << "Кол-во трехзначных чисел:" << sum << endl;

			system("pause");
    return 0x1;
	
	}
	};



/////////   БЕЗ указателей    \\\\\\\\\\\\\\\
Имя массива является константным указателем на начало массива.
	//int n;
	//int sum=0; // подсчет кол-ва циклов (т.е 3х значных цифр)
	//for(n>104;n<976;n+=30){   //зациклим вывод чисел *./ каждый раз к числу +30 и так пока не дойдет до 975
	//		cout << n << " ";
	//	sum++;} // каждый раз, когда выполняется цикл +1 к sum
	//	cout << endl << "Кол-во трехзначных чисел:" << sum << endl;


//int n, *pn;
 //   pn=&n;